app/Models/GroupesModel.php

   public function getEtudiantsByIdGroupes($id_groupe)
   {
      $results = $this->join('inscription', 'groupe.id_groupe=inscription.groupe_id');
      $results = $this->join('etudiant', "etudiant.id_etudiant=inscription.etudiant_id");
      $results = $this->where('groupe.id_groupe', $id_groupe);
      $results = $this->orderBy('etudiant.nom_etudiant', 'ASC');
      $results = $this->find();
---
SELECT *
FROM `groupe`
JOIN `inscription` ON `groupe`.`id_groupe`=`inscription`.`groupe_id`
JOIN `etudiant` ON `etudiant`.`id_etudiant`=`inscription`.`etudiant_id`
WHERE `groupe`.`id_groupe` = '36'
ORDER BY `etudiant`.`nom_etudiant` ASC